* Java & Clojure: clojure in emacs
** Clojure
*** recursion: Clojure Tail Call Optimizer https://github.com/cjfrisz/clojure-tco
*** dashing: drawing with certain velocity
*** cljart <3
*** defrecord is a cartesian product
*** GeoREPL
*** Cursive
*** Chicago Clojure - 2017-06-21: Stuart Halloway on Repl Driven Development:
**** TODO Don't throw things away - save a file once in a month
**** Visualisation - Desktop GUI: Seesaw - Live at REPL (as a custom inspector)
**** Start java with a clojure.jar and hook up a REPL with custom prompt
**** specs + graphvis: https://github.com/jebberjeb/specviz
**** Lisp Continuations: replace this exception with some value and keep going
***** JVM doesn't have continuations so Clojure doesn't have them neither
*** CJUG - 2017-06-20 - Stuart Halloway on Clojure in 10 Big Ideas: 18:43
** Java & JVM
*** Based on stack-based processor
*** Statically typed instruction set
*** http://www.root.cz/clanky/pohled-pod-kapotu-jvm-5-cast-popis-virtualniho-stroje-javy/
** scala
*** xml - first class support
*** default get/set methods & constructor
*** function & imperative
*** staticaly typed
*** traits (multiple inheritance)
*** clojuredocs - graphic representation of example
#+BEGIN_SRC clojure
lein swank-wrap 4005 webcli.server
slime-connect
(let [x 1]
  (swank.core/break))
#+END_SRC
*** Rick Hickey - TBD (To Better Do)
  - User interfaces on top of programatic interfaces
  - use composable services
  - abstractions; no bespoke protocols and formats
* Clojure AI
** Eric Weinstein: Machine learning with Clojure and Apache Stark
*** Apache Spark:
**** Supervised learning, Generalization
**** Classification or regression, generalizing from labeled to unlabeled data
**** cluster computing framework - ideal for large data sets
***** RDD Resilient Distrib Dataset
***** Datase: RDD + Spark SQL execution engine
***** DataFrame: dataset ordanized into named columns
** Los Angeles police stop data, 600.000 http://bit.ly/2f9jVwn
** Decision Trees (binary classifier) robust in noise; good for binary
** No universal approach
** Racist data leads to racist machines - bias problem
** What's Deep learning
*** neural networks - computational architecture modeled after brain
**** many layers
**** vanishing/exploding gradient problem
*** Vanishing && Exploding Gradients
*** Convolutional networks; stacks of feature maps
*** Max Pooling / Downsampling
*** Alternating Layers
** Tale of two DSLs: Flambo vs. Sparkling
*** 1. Flambo
*** 2. Sparkling
*** DL4J - Deep Learning 4 Java
** nuroko.com - Nuroko Toolkit: Advanced machine learning (painting)
** Peter Norvig / Stuart Russell: Artificial Intelligence: A Modern Approach
** Syntax of log files changes (speach) sentence structure: subject comes at the end of line
** Music: what is the relation between harmony and ryth; model of musical creativity
** How represent speach context?
** Create experience dbase
** Android App: picture comparision
** put together: chess ** languages **
** Problemy tazke pre comp, lahke pre cloveka (arimaa - until 2020, etc.)
** Lang words as a sound: celular automata: cell dyies / is born: play a tone
** Society by Niklas Luhmann: (People are) recursing, self referencing systems of communication
*** specialisations
*** mastery vs. novelty (expensive)
*** dealing with complexity of options

* org mode tagging                                                      :org:

| col1    | col2          |
|---------+---------------|
| content | other content |


#+BEGIN_SRC emacs-lisp
  (message "Yeah from emacs-lisp!")
#+END_SRC

#+RESULTS:
: Yeah from emacs-lisp!

#+BEGIN_SRC sh :exports both
echo "Hello World from sh" # evaluate: C-c
#+END_SRC

#+RESULTS:
: Hello World

#+begin_src clojure :results silent
;; ":results silent" causes result to be displayed in the mini-buffer
;; M-x cider-jack-in
(+ 1 4)
#+end_src

#+BEGIN_SRC clojure
(defproject my-project "0.1.0"
  :description "My great Clojure project"
  :dependencies
  [[org.clojure/clojure "1.9.0"]])
(println "Hello from clojure")
#+END_SRC

#+BEGIN_SRC python
# Result displayed under '#+RESULTS:'
return "Hello from Python" # evaluate: C-c
#+END_SRC

#+RESULTS:
: Hello from Python

#+RESULTS:
: Hello from python

:Compare-2-bitmaps:
#+BEGIN_SRC
// http://stackoverflow.com/questions/10487152/comparing-two-images-for-motion-detecting-purposes
private int returnCountOfDifferentPixels(String pic1, String pic2) {
        Bitmap i1 = loadBitmap(pic1);
        Bitmap i2 = loadBitmap(pic2);

        int count=0;
        for (int y = 0; y < i1.getHeight(); ++y)
               for (int x = 0; x < i1.getWidth(); ++x)
                    if (i1.getPixel(x, y) != i2.getPixel(x, y)) {
                        count++;
                    }
        return count;
    }
#+END_SRC
:END:

:Brick-a-Brack:
What is: David Allen's GTD (Getting Things Done) system
Cheatsheet as orgmode document
Formating with **/-/* etc.

http://www.zdrojak.cz/clanky/tvorba-moderniho-e-shopu-dokonceni-uzivatelske-casti/
Sequence of QR Codes/ graphical elements (pyramide, cube, sphere, toroid, etc.)
Responsive, mobile-first web sites https://www.w3schools.com/bootstrap/

Open Source Ecology: https://en.wikipedia.org/wiki/Open_Source_Ecology
Code as a Lego Block http://www.ted.com/talks/ayah_bdeir_building_blocks_that_blink_beep_and_teach.html
Smart the collective brain http://www.ted.com/talks/matt_ridley_when_ideas_have_sex.html
bicycle clickies
time bank
dokaz identity bez udania mena
google lab tags http://www.chromeweblab.com/en-GB/lab-tag-explorer
stuff to datomic - ?git has no services? http://www.youtube.com/watch?v=ROor6_NGIWU 58:00

klipse
Smart Contacts, Cardano
GraphQL
Pure vs. mostly harmless functions
:END:

:terminals:
# A terminal for a more modern age
https://github.com/Eugeny/terminus

# electron-app terminal
https://github.com/zeit/hyper
:end:

:Books-Amazon:
HoTT https://homotopytypetheory.org/ (notion of equality)
Proofs, Formal Verification
LaTTe
bought books - Pierre
SICP

The Little Schemer
The Seasoned Schemer
The Reasoned Schemer
The Little LISPer
The Little Prover
The Little MLer
The Little Typer
:END:

:Lang:
http://www.ted.com/talks/patricia_kuhl_the_linguistic_genius_of_babies.html?fb_ref=talk
Learning pronounciation
How much of a language is silent? What does it look like when you take the silence out? (Video 2 Min)
http://www.theverge.com/2012/7/1/3129227/silenc-project-silent-letters
http://golancourses.net/ciid/19/silenc/
idioms, link sur FB, idioms - traduction + correcture
spelling glyphs
Comprehension - facile, s'exprimer - difficile
linguee.com - eu-texts
le Svejk, l'Etrangeur - examples
Communication w-/wo- Letters
:END:
